Tasks/Сообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Task>
		<Properties>
			<Name>Сообщения</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

AccumulationRegisters/ОбъектыВРаботе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ОбъектыВРаботе</Name>
			<Comment>Трейд Софт</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ОтветственныеСотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеСотрудники</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыСотрудников</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КДолговомуОбязательству</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КСотрудникуИДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КТипуСотрудника</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Tasks/Сообщения/Forms/ФормаЗадачи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Пользователи.ЗаполнитьРеквизитыПоДаннымПользователя(Объект);		
		Объект.ПланируемаяДата = ТекущаяДата();		
	КонецЕсли;
	ТипСообщенияПриИзмененииСервер();
КонецПроцедуры

&НаКлиенте
Процедура ТипСообщенияПриИзменении(Элемент)
	ТипСообщенияПриИзмененииСервер();
КонецПроцедуры

&НаСервере
Процедура ТипСообщенияПриИзмененииСервер()
	Если Объект.ТипСообщения = Перечисления.ТипыСообщений.КСотруднику Тогда
		Элементы.Организация.Видимость = Ложь;
		Элементы.Подразделение.Видимость = Ложь;
		Элементы.Ответственный.Видимость = Истина;
		Элементы.ТипСотрудника.Видимость = Ложь;
		Элементы.Объект.Видимость = Ложь;
		
	ИначеЕсли Объект.ТипСообщения = Перечисления.ТипыСообщений.КДолговомуОбязательству Тогда
		Элементы.Организация.Видимость = Ложь;
		Элементы.Подразделение.Видимость = Ложь;
		Элементы.Ответственный.Видимость = Ложь;
		Элементы.ТипСотрудника.Видимость = Ложь;
		Элементы.Объект.Видимость = Истина;
		
	ИначеЕсли Объект.ТипСообщения = Перечисления.ТипыСообщений.КСотрудникуИДО Тогда	
		Элементы.Организация.Видимость = Ложь;
		Элементы.Подразделение.Видимость = Ложь;
		Элементы.Ответственный.Видимость = Истина;
		Элементы.ТипСотрудника.Видимость = Ложь;
		Элементы.Объект.Видимость = Истина;
		
	ИначеЕсли Объект.ТипСообщения = Перечисления.ТипыСообщений.КТипуСотрудника Тогда
		Элементы.Организация.Видимость = Ложь;
		Элементы.Подразделение.Видимость = Ложь;
		Элементы.Ответственный.Видимость = Ложь;
		Элементы.ТипСотрудника.Видимость = Истина;
		Элементы.Объект.Видимость = Истина;
		
	Иначе
		Элементы.Организация.Видимость = Ложь;
		Элементы.Подразделение.Видимость = Ложь;
		Элементы.Ответственный.Видимость = Ложь;
		Элементы.ТипСотрудника.Видимость = Ложь;
		Элементы.Объект.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Наименование = СокрЛП(Объект.Наименование);
	Объект.Текст = СокрЛП(Объект.Текст);
	Если Объект.Наименование = "" Тогда
		Объект.Наименование = "Сообщение";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыполнение(Команда)
	Объект.Выполнена = Ложь;
	Записать();
КонецПроцедуры

&НаСервере
Функция ЯвляетсяЛиТекущийПользовательАдресатом()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Сообщения.Ссылка
	                      |ИЗ
	                      |	Задача.Сообщения КАК Сообщения
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(, Сотрудник = &Сотрудник) КАК ОбъектыВРаботеОстатки
	                      |		ПО Сообщения.Объект = ОбъектыВРаботеОстатки.Объект
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
	                      |		ПО (ОбъектыВРаботеОстатки.Объект = ОтветственныеСотрудники.Объект)
	                      |			И (ОтветственныеСотрудники.Пользователь = &Сотрудник)
	                      |ГДЕ
	                      |	(Сообщения.ТипСообщения = ЗНАЧЕНИЕ(Перечисление.ТипыСообщений.КСотруднику)
	                      |				И Сообщения.Сотрудник = &Сотрудник
	                      |			ИЛИ Сообщения.ТипСообщения = ЗНАЧЕНИЕ(Перечисление.ТипыСообщений.КДолговомуОбязательству)
	                      |				И НЕ ОбъектыВРаботеОстатки.Объект ЕСТЬ NULL 
	                      |			ИЛИ Сообщения.ТипСообщения = ЗНАЧЕНИЕ(Перечисление.ТипыСообщений.КСотрудникуИДО)
	                      |				И НЕ ОбъектыВРаботеОстатки.Объект ЕСТЬ NULL 
	                      |				И Сообщения.Сотрудник = &Сотрудник
	                      |			ИЛИ Сообщения.ТипСообщения = ЗНАЧЕНИЕ(Перечисление.ТипыСообщений.КТипуСотрудника)
	                      |				И НЕ ОтветственныеСотрудники.Объект ЕСТЬ NULL 
	                      |				И Сообщения.ТипСотрудника = ОтветственныеСотрудники.ТипСотрудника)
	                      |	И Сообщения.Ссылка = &Ссылка");
						  
	Запрос.УстановитьПараметр("Сотрудник", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не Объект.Ссылка.Пустая() И Не Объект.Прочитано И ЯвляетсяЛиТекущийПользовательАдресатом() Тогда
		Объект.Прочитано = Истина;
		ЭтаФорма.Записать();
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//ДокументОбъект = РеквизитФормыВЗначение("Объект");
	//ДокументОбъект.ПриЗаписи(Неопределено);
КонецПроцедуры
